TSD_TK/src/DataProcessors/Комплектовщик/Комплектовщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Комплектовщик</name>
  <tabularSections>
    <name>Документы</name>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TSD_TK/src/DataProcessors/Комплектовщик/Forms/ФормаСобратьВолну/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие;

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДопоплнительныеПараметры) Экспорт

    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;
    ИнициализироватьКонстантыФормы();
    ОбновитьПодразделение();
    ОбновитьСотрудника();
    НастроитьФормуПоЗначениямНастроек();
    Отказ = Отказ Или ВзятьРезервНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ВыполняетсяЗакрытие = Ложь;

#Если МобильноеПриложениеКлиент Тогда
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "Сканировать", "Видимость", Ложь);
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

    Если ЗначениеЗаполнено(ДокументUUID) Тогда
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Не ВыполняетсяЗакрытие Тогда
        Отказ = Истина;
        ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Завершити відбір?",
            РежимДиалогаВопрос.ДаНет);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

    Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда

        ДополнительныеПараметры = Новый Структура;
        ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
        Если ИдетПроцессСканированияТелеги Тогда
            ОбработатьШтрихкодТелеги(Параметр, ДополнительныеПараметры);
        Иначе
            ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

#Область ОбработкаШтрихкодов
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт

    Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
        Возврат;
    КонецЕсли;

    Если ИД_Статус <> 1 Тогда
        Возврат;
    КонецЕсли;

    Если ИдетПроцессСканированияТелеги Тогда
        ОбработатьШтрихкодТелеги(ПолученныйШтрихкод, Параметры);

        Возврат;
    КонецЕсли;
    ТквВведено = ТекКоличествоВведеноКоробка;
    Если ТквВведено = ТекКоличество Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Кількість відібрано, перейдіть до наступного");
        Возврат;
    КонецЕсли;

    НСтркиШтрихКод = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("ШтрихКод", ПолученныйШтрихкод));
    
    //Если ТекПроизводитель <> 0 И (ТекидУпаковка  = 2 Или ТекидУпаковка  = 3) Тогда //ФМ/БАТ Блоки,Ящики, 
    //  
    //  ЭтоИсключение = Ложь;
    //  Если нСтркиШтрихКод.Количество() > 0 И нСтркиШтрихКод[0].Артикул = ТекАртикул Тогда
    //      ЭтоИсключение = ПроверитьИсключение(ТекАртикул);    
    //  КонецЕсли;
    //  Если НЕ ЭтоИсключение Тогда
    //      ОбработатьШтрихКодФМ_БАТ(ПолученныйШтрихкод,Параметры); 
    //      Возврат;
    //  КонецЕсли;
    //КонецЕсли;
    ПоМаскеШтрихКода = Ложь;
    Если нСтркиШтрихКод.Количество() = 0 Тогда
        СтрШтрихКод = Новый Структура;
        СтрШтрихКод.Вставить("Штрихкод", ПолученныйШтрихкод);
        СтрШтрихКод.Вставить("Количество", 1);
        СтрШтрихКод.Вставить("Коэффициент", 1);
        СтрШтрихКод.Вставить("КодВесовогоТовара", "");
        СтрШтрихКод.Вставить("ПрефиксВесовогоТовара", "");
        ОбработатьВесовойШтрихкод(СтрШтрихКод);
        Если ПустаяСтрока(СтрШтрихКод.КодВесовогоТовара) Тогда
            ОбщегоназначенияКлиентСервер.СообщитьПользователю("У документі немає товару з цим штрихкодом - "
                + ПолученныйШтрихкод);
            Возврат;
        Иначе

            Если Не СтрШтрихКод.КодВесовогоТовара = ТекАртикул Тогда
                ОбщегоназначенияКлиентСервер.СообщитьПользователю("Ваговий артикул не належить товару - "
                    + ТекНаименованиеТовара);
                Возврат;
            КонецЕсли;

            ПоМаскеШтрихКода = Истина;
        КонецЕсли;
    КонецЕсли;
    Если Не ПоМаскеШтрихКода Тогда
        СтрШтрихКод = нСтркиШтрихКод[0];
        Если Не СтрШтрихКод.Артикул = ТекАртикул Тогда
            ОбщегоназначенияКлиентСервер.СообщитьПользователю("Штрихкод не належить товару - " + ТекНаименованиеТовара);
            Возврат;
        КонецЕсли;
    КонецЕсли;

    Если ТекШтрихКодОтсканирован = Ложь Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияСканироватьКодТовара",
            "Видимость", Ложь);
        ТаблицаТовары[СтрокаТовараТекущая - 1].ШтрихКодОтсканирован = Истина;

    КонецЕсли;
    ТекШтрихКодОтсканирован = Истина;   
    //11.09.2025 - Ивченко Ольга Александровна <Olga.Ivchenko@digma.ua>
    //ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено,ДобавитьКолВо", "Доступность", ТекШтрихКодОтсканирован);
    //11.09.2025 - Ивченко Ольга Александровна <Olga.Ivchenko@digma.ua>
    // 02.07.2025 - ввод количества если больеш 25 шт
    // ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(Этотобъект, "ТекКоличествоВведено,ДобавитьКолВо", "Доступность", ТекКоличество >3);

    Если ТекКоэффициент = СтрШтрихКод.Коэффициент Тогда
        НовКоличество = ?(ПоМаскеШтрихКода, СтрШтрихКод.Количество, 1);

    Иначе
        НовКоличество = СтрШтрихКод.Коэффициент / ?(ТекКоэффициент = 0, 1, ТекКоэффициент);
    КонецЕсли;

    Если ТекВесовой = 0 И новКоличество < 1 Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати " + новКоличество + " відскануйте штрихкод "
            + ТекУпаковка + Символы.ПС + "Додайте кількість в ручну");
        Возврат;
    КонецЕсли;

    Если ТекВесовой И ТекКоличествоВведеноКоробка + новКоличество > ТекКоличество Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати " + новКоличество);
        Возврат;

    КонецЕсли;

    Если ТекиспХарактеристика = 1 Тогда
        ВыбратьМРЦ_Асинх(ТекХарактеристика, ПолученныйШтрихкод, СтрШтрихКод.Коэффициент);
    Иначе  
         //Если ТекВесовой = 1 Тогда
         //    ТекКоличествоВведеноВес = ТекКоличествоВведеноВес + новКоличество ;
         //Иначе
        ТекКоличествоВведено = ТекКоличествоВведено + новКоличество;
         //КонецЕсли; 

        МУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,КоробкаНомер", ТекАртикул,
            КоробкаНомер));
        Если МУпаковщик.Количество() Тогда
            СмУпаковка = мУпаковщик[0];
        Иначе
            СмУпаковка = ТаблицаТоварыУпаковщик.Добавить();
            СмУпаковка.Артикул = ТекАртикул;
            СмУпаковка.КоробкаНомер = КоробкаНомер;

        КонецЕсли;

        СмУпаковка.КоличествоВведено = ТекКоличествоВведено;
        СмУпаковка.Коэффициент = ТекКоэффициент;
        СмУпаковка.Телега = ТекТелега;

        ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияПерейти", "Видимость",
            ТекКоличествоВведеноКоробка = ТекКоличество);

    КонецЕсли;

КонецПроцедуры
#КонецОбласти
#КонецОбласти
&НаКлиенте
Процедура ОбработатьШтрихкодТелеги(ПолученныйШтрихкод, Параметры) Экспорт

    Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
        Возврат;
    КонецЕсли;

    Результат = ПроверитьТележку(ПолученныйШтрихкод);
    Если ПустаяСтрока(Результат.ТекстОшибки) И Результат.ТележкаРабочий Тогда
        ИдетПроцессСканированияТелеги = Ложь;
        КоробкаОткрыта = Истина;
        ТекТелега = ПолученныйШтрихкод;
        КоробкаНомер = КоробкаНомер + 1;
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
            "ГруппаДокумент,ГруппаКнопки,ГруппаЗакрытьКоробку", "Видимость", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУпаковкаКоробка", "Видимость",
            Ложь);
    Иначе
        Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
            Сообщить(Результат.ТекстОшибки);
        Иначе
            Сообщить("Не вдалося відсканувати візок!");
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВзятьРезервНаСервере()

    Если Не Инициализирован Или Не ПользовательИнициализирован Тогда
        Возврат Истина;
    КонецЕсли;
    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/mrezervrab?uuidcom=" + ПараметрыСеанса.Сотрудник_ID;

    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если Не РезОтвет.Результат Тогда
        Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
            Сообщить(РезОтвет.ОписаниеОшибки);
        Иначе
            Сообщить("Помилка отримання резервів!");
        КонецЕсли;
        Возврат Истина;
    КонецЕсли;

    СтруктураДокумента = РезОтвет.Ответ;

    Если СтруктураДокумента.Товары.Количество() = 0 Тогда
        Сообщить("Нет товаров для сборки");
        Возврат Истина;
    КонецЕсли;

    Страрт = ТекущаяДата();
    ДокументUUID = СтруктураДокумента.ДокументUUID;
    дВес = СтруктураДокумента.Вес;
    дКоличествоБаз = СтруктураДокумента.КоличествоБаз;
    НачалоКонтроля = ТекущаяДата();
    Если СтруктураДокумента.Свойство("Порядок") Тогда
        Порядок  = "м-" + СтруктураДокумента.Порядок;
    КонецЕсли;
	
	
	//СтруктураДокумента.Свойство("КомплектовщикУпаковщик",КомплектовщикУпаковщик);
    КомплектовщикУпаковщик = Истина;

    Для Каждого стТовар Из СтруктураДокумента.Товары Цикл
        нстрТовар = ТаблицаТовары.Добавить();
        нстрТовар.Артикул = стТовар.Артикул;
        нстрТовар.ТоварнаяМарка = стТовар.ТоварнаяМарка;
        нстрТовар.НаименованиеТовара = стТовар.Номенклатура;
        нстрТовар.Упаковка           = стТовар.ЕдиницаИзмерения;
        нстрТовар.Характеристика    = стТовар.ЗначениеМРЦ;
        нстрТовар.испХарактеристика    = стТовар.испХарактеристика;

        нстрТовар.Коэффициент      = стТовар.Коэффициент;
        нстрТовар.Количество      = стТовар.Количество;
        нстрТовар.КоличествоБаз      = стТовар.КоличествоБаз;
        нстрТовар.Производитель      = стТовар.Производитель; //1-ФМ, 2-БАТ, 0-Все остальные
        нстрТовар.идУпаковка      = стТовар.идУпаковка;  //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные
		//нстрТовар.ЗаказИД       = стТовар.ЗаказИД;
		//нстрТовар.СкладИД       = стТовар.СкладИД;
        нстрТовар.Весовой       = стТовар.Весовой;
        нстрТовар.МестоХранение = стТовар.НомерЯчейки;
        нстрТовар.Мест = стТовар.Мест;

    КонецЦикла;

    Для Каждого стШтрихКод Из СтруктураДокумента.ШтрихКода Цикл

        нстрШтрихКод = ТаблицаШтрихКода.Добавить();
        нстрШтрихКод.ШтрихКод = СокрЛП(стШтрихКод.ШтрихКод);
        нстрШтрихКод.Артикул = стШтрихКод.Артикул;
        нстрШтрихКод.Упаковка = стШтрихКод.Упаковка;
        нстрШтрихКод.Коэффициент = стШтрихКод.Коэффициент;

    КонецЦикла;

    СтрокаТовараВсего = ТаблицаТовары.Количество();
    СтрокаТовараТекущая = 1;
    стрТовары = ТаблицаТовары[0];

    ТекАртикул = стрТовары.Артикул;
    ТекВесовой = стрТовары.Весовой;
    ТекИдентификаторСтроки = стрТовары.ПолучитьИдентификатор();
    ТекКоличество = стрТовары.Количество;
    ТекКоличествоВведено = стрТовары.КоличествоВведено;

    ТекКоэффициент = стрТовары.Коэффициент;
    ТекМестоХранение = стрТовары.МестоХранение;
    ТекМестоХранениеИД = стрТовары.МестоХранениеИД;
    ТекТоварнаяМарка = стрТовары.ТоварнаяМарка;
    ТекНаименованиеТовара = стрТовары.НаименованиеТовара;
    ТекУпаковка	          = стрТовары.Упаковка;
    ТекХарактеристика     = стрТовары.Характеристика;
    ТекиспХарактеристика     = стрТовары.испХарактеристика;

    ТекПроизводитель      = стрТовары.Производитель; //1-ФМ, 2-БАТ, 0-Все остальные
    ТекидУпаковка         = стрТовары.идУпаковка;    //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные 
    ТекМест         = стрТовары.Мест;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияДанныеУп", "Заголовок", "("
        + ТекУпаковка + "." + ТекКоэффициент + ") " + ТекМест);

    РучнойВводБезШтрикода = Ложь;  //11.09.2025 - Ивченко Ольга Александровна <Olga.Ivchenko@digma.ua>

    Если ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул", ТекАртикул)).Количество() = 0 И Не (ТекПроизводитель
        = 1 Или ТекПроизводитель = 2) ИЛИ  ТекКоличество > КомплектовщикТК_КлиентСервер.ДоступноБезСканирования() Тогда
        ТекШтрихКодОтсканирован = Истина;  //нет штрихкодов ввод вручную   
        РучнойВводБезШтрикода = Истина;
    Иначе
        ТекШтрихКодОтсканирован = стрТовары.ШтрихКодОтсканирован;
    КонецЕсли;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
        "ТекКоличество,ТекКоличествоВведеноКоробка,ТекКоличествоВведено", "Формат", ?(ТекВесовой = 1, "ЧЦ=15; ЧДЦ=3",
        "ЧЦ=15; ЧДЦ=0"));	
   	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", Истина );
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведеноВес", "Видимость", ТекВесовой = 1 ); 
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаСтрокаМРЦ", "Видимость",
        ТекиспХарактеристика = 1);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаЗакрытьКоробку", "Видимость", Ложь);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
        "ГруппаДокумент,ДекорацияПерейти,ГруппаШапкаДокумента,ГруппаУпаковкаКоробка", "Видимость", Ложь);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаЗадачиНаСборку", "Видимость", Ложь);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаКнопки", "Видимость", Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ТекКоличествоВведено,ДобавитьКолВо",
        "Доступность", РучнойВводБезШтрикода);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияСканироватьКодТовара",
        "Видимость", ТекШтрихКодОтсканирован = Ложь);
    Возврат Ложь;

КонецФункции
#Область прог

&НаСервере
Процедура ИнициализироватьКонстантыФормы()

    ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
    Инициализирован = Не ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = Не ПустаяСтрока(ПараметрыСеанса.Сотрудник);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСотрудника()

    Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
        Элементы.СообщениеИнициализацииПользователя.Заголовок = "Пользователь не инициализирован";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Ложь;
    Иначе
        Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Истина;
    КонецЕсли;

    УстановитьДоступностьПоНастройкам();
	//Если ПользовательИнициализирован И Инициализирован Тогда
	//	ОбновитьКоличестворезервовНаСервере();
	//КонецЕсли;
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент", "Видимость", Ложь);

КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()

    Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
        Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
        Инициализирован = Ложь;

    Иначе

        Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
        Инициализирован = Истина;

    КонецЕсли;

    ОпределитьДоступностьКнопкиСканирования();

КонецПроцедуры
&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	//ОпределитьДоступностьКнопкиСканирования();
	//
	//НастроитьЭлементыАсинхронногоСканера();   
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаРасхождения", "Видимость", Ложь);
КонецПроцедуры
&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

    ОпределитьДоступностьКнопкиСканирования();
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
        Инициализирован И ПользовательИнициализирован);

КонецПроцедуры


//&НаСервере
//Процедура НастроитьЭлементыАсинхронногоСканера()
//	
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
//		ИспользуетсяАсинхронныйСканер
//	);
//	
//КонецПроцедуры

&НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()

    ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
        (ЕстьОборудованиеСканирования И Не ИспользуетсяАсинхронныйСканер) И Инициализирован
        И ПользовательИнициализирован);
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура Сканировать(Команда)

    ИдетПроцессСканирования = Истина;
    ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
    ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
    ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
    ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");

    ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)

    ИнициализироватьАсинхронныйСканер();

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()

    ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);

КонецПроцедуры
&НаКлиенте
Функция ВсегоТекВведеноУпаковщик(АртикулУпаковка = Ложь, ТолькоУпаковка = Ложь)
    Если АртикулУпаковка Тогда
        оСтруктураУп = 	Новый Структура("Артикул,КоробкаНомер", ТекАртикул, КоробкаНомер);
    ИначеЕсли ТолькоУпаковка Тогда
        оСтруктураУп = 	Новый Структура("КоробкаНомер", КоробкаНомер);
    Иначе
        оСтруктураУп = 	Новый Структура("Артикул", ТекАртикул);
    КонецЕсли;
    нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(оСтруктураУп);
    КолУпаковано = 0;
    Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл
        КолУпаковано = КолУпаковано + стрУпаковщик.КоличествоВведено;
    КонецЦикла;
    Возврат КолУпаковано;
КонецФункции
&НаКлиенте
Процедура ПерейтиНаЗапросФормированияДокументов()

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаСтрокаТовара,ГруппаКнопки",
        "Видимость", Ложь);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаКнопкиОтменаОК", "Видимость", Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаРасхождения", "Видимость",
        ТаблицаРасхождений.Количество() > 0);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьПереходКнопкиВпередНазад(текСтрокаТовара)
    ТекАртикул = текСтрокаТовара.Артикул;
    ТекВесовой = текСтрокаТовара.Весовой;
    ТекИдентификаторСтроки = текСтрокаТовара.ПолучитьИдентификатор();
    ТекКоличество = текСтрокаТовара.Количество;
    ТекКоличествоВведено = текСтрокаТовара.КоличествоВведено;
    ТекКоэффициент = текСтрокаТовара.Коэффициент;
    ТекМестоХранение = текСтрокаТовара.МестоХранение;
    ТекМестоХранениеИД = текСтрокаТовара.МестоХранениеИД;
    ТекТоварнаяМарка = текСтрокаТовара.ТоварнаяМарка;
    ТекНаименованиеТовара = текСтрокаТовара.НаименованиеТовара;
    ТекУпаковка	          = текСтрокаТовара.Упаковка;
    ТекХарактеристика     = текСтрокаТовара.Характеристика;
    ТекиспХарактеристика  = текСтрокаТовара.испХарактеристика;

    ТекПроизводитель      = текСтрокаТовара.Производитель;  //1-ФМ, 2-БАТ, 0-Все остальные
    ТекидУпаковка         = текСтрокаТовара.идУпаковка;    //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные 
    ТекМест               = текСтрокаТовара.Мест;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияДанныеУп", "Заголовок", "("
        + ТекУпаковка + "." + ТекКоэффициент + ") " + ТекМест);

    РучнойВводБезШтрикода = Ложь;
    Если ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул", ТекАртикул)).Количество() = 0 И Не (ТекПроизводитель
        = 1 Или ТекПроизводитель = 2) ИЛИ ТекКоличество > КомплектовщикТК_КлиентСервер.ДоступноБезСканирования() Тогда
        ТекШтрихКодОтсканирован = Истина;
        РучнойВводБезШтрикода  = Истина;   //нет штрихкодов ввод вручную 
    Иначе

        ТекШтрихКодОтсканирован = текСтрокаТовара.ШтрихКодОтсканирован;
    КонецЕсли;

    Если ТекиспХарактеристика = 1 Тогда
        нстрокиМРЦ =  ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("Артикул", ТекАртикул));
        счМРЦ = 0;
        Для Каждого стрнстрокиМРЦ Из нстрокиМРЦ Цикл
            счМРЦ = счМРЦ + стрнстрокиМРЦ.КоличествоВведено;
            ТекХарактеристика = стрнстрокиМРЦ.Характеристика;
        КонецЦикла;
        ТекКоличествоВведено = счМРЦ;
    КонецЕсли;
	
	//Итого по товару
    нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул", ТекАртикул));
    ТекКоличествоВведеноКоробка = 0;
    Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл
        ТекКоличествоВведеноКоробка = ТекКоличествоВведеноКоробка + стрУпаковщик.КоличествоВведено;
    КонецЦикла;
    нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,КоробкаНомер", ТекАртикул,
        КоробкаНомер));
	//Итого по коробке упаковщика
    текКолКоробкаНом = 0;
    Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл
        текКолКоробкаНом = текКолКоробкаНом + стрУпаковщик.КоличествоВведено;
    КонецЦикла;

    ТекКоличествоВведено = текКолКоробкаНом;	
	//ТекКоличествоВведеноВес = текКолКоробкаНом;
    ОбщегоНазначенияКлиентСервер.ОформитьКоличественныеПоляВвода(ЭтотОбъект,
        "ТекКоличество,ТекКоличествоВведено,ТекКоличествоВведеноКоробка", ТекВесовой = 1);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличество,ТекКоличествоВведено,ТекКоличествоВведеноКоробка", "Формат", ?(ТекВесовой = 1,"ЧЦ=15; ЧДЦ=3; ЧН=0,000","ЧЦ=15; ЧДЦ=0; ЧН=0"));	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", ТекВесовой = 0 );
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведеноВес", "Видимость", ТекВесовой = 1 );


    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
        "ГруппаСтрокаТовара,ГруппаСтрокаТовараОтборЕдиница,ГруппаКнопки", "Видимость", Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаСтрокаМРЦ", "Видимость",
        ТекиспХарактеристика = 1);

    Если ТекПроизводитель = 0 Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ТекКоличествоВведено,ДобавитьКолВо",
            "Доступность", РучнойВводБезШтрикода);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияСканироватьКодТовара",
            "Видимость", ТекШтрихКодОтсканирован = Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ТекКоличествоВведено", "Доступность",
            ТекПроизводитель = 0);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияСканироватьКодТовара",
            "Видимость", ТекПроизводитель <> 0);
    КонецЕсли;

    ТекКоличествоВведеноВесШт = ТекКоличествоВведено;
    Если ТекКоличествоВведеноВесШт = ТекКоличество Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияСканироватьКодТовара",
            "Видимость", Ложь);
    КонецЕсли;

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияПерейти", "Видимость",
        ТекКоличествоВведеноКоробка = ТекКоличество);
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ОбработатьПереходВперед();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПереходВперед()

    МестоХраненияОтсканировано = Ложь;
    текСтрокатовары = ТаблицаТовары.НайтиПоИдентификатору(ТекИдентификаторСтроки);
    текСтрокатовары.КоличествоВведено = ВсегоТекВведеноУпаковщик();//?(ТекВесовой = 0,ТекКоличествоВведено,ТекКоличествоВведеноВес);		
    текСтрокатовары.Отобрано = текСтрокатовары.Количество = текСтрокатовары.КоличествоВведено;
    текСтрокатовары.ШтрихКодОтсканирован = ТекШтрихКодОтсканирован;
    СтрокаТовараТекущая = СтрокаТовараТекущая + 1;

    Если СтрокаТовараТекущая <= СтрокаТовараВсего Тогда
        новСтрокатовары = ТаблицаТовары[СтрокаТовараТекущая - 1];
        ОбработатьПереходКнопкиВпередНазад(новСтрокатовары);

    Иначе
        СтрокаТовараТекущая = СтрокаТовараТекущая - 1;
        ТаблицаРасхождений.Очистить();
        мНеОтобранныеСтроки =  ТаблицаТовары.НайтиСтроки(Новый Структура("Отобрано", Ложь));
        Если мНеОтобранныеСтроки.Количество() > 0 Тогда
            Для Каждого стрТоварыОт Из мНеОтобранныеСтроки Цикл
                стрТаблицаРасхождений = ТаблицаРасхождений.Добавить();
                ЗаполнитьЗначенияСвойств(стрТаблицаРасхождений, стрТоварыОт,
                    "НаименованиеТовара,Упаковка,Артикул,Коэффициент,Количество,КоличествоВведено,Весовой,КоличествоБаз");
                стрТаблицаРасхождений.ИдентификаторСтрокиТоваров = стрТоварыОт.ПолучитьИдентификатор();
            КонецЦикла;
			//	Иначе

        КонецЕсли;  
		
		//Если КоробкаОткрыта И ВсегоТекВведеноУпаковщик(Истина) Тогда
		//	
		//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Истина);	
		//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Ложь);	
		//	
		//Иначе
			//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Ложь);	
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Истина);	
			
		//КонецЕсли;
		
		//Элементы.ГруппаШапкаДокумента.Показать();

        ПерейтиНаЗапросФормированияДокументов();

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КнопкаВперед(Команда)
    Если ИД_Статус = 0 Тогда
        ИД_Статус = 1;

        Если КомплектовщикУпаковщик И Не КоробкаОткрыта Тогда
            ИдетПроцессСканированияТелеги = Истина;
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаУпаковкаКоробка",
                "Видимость", Истина);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаКнопки,ГруппаТовары",
                "Видимость", Ложь);

        Иначе

            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТовары,ДекорацияПерейти",
                "Видимость", Ложь);	
			//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличество,ТекКоличествоВведено", "Формат", ?(ТекВесовой = 1,"ЧЦ=15; ЧДЦ=3","ЧЦ=15; ЧДЦ=0"));	
            ОбщегоНазначенияКлиентСервер.ОформитьКоличественныеПоляВвода(ЭтотОбъект,
                "ТекКоличество,ТекКоличествоВведено", ТекВесовой = 1);

            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
                "ГруппаДокумент,ГруппаСтрокаТовара,ГруппаСтрокаТовараОтборЕдиница,ГруппаКнопки", "Видимость", Истина);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаСтрокаМРЦ", "Видимость",
                ТекиспХарактеристика = 1);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияПерейти", "Видимость",
                ТекКоличествоВведеноКоробка = ТекКоличество);

        КонецЕсли;
        Возврат;
    КонецЕсли;

    тквВведено =  ТекКоличествоВведеноКоробка;
    Если тквВведено > ТекКоличество Тогда
        Сообщить("Перевищено кількість відбору!");
        Возврат;
    ИначеЕсли ТекКоличество > тквВведено Или тквВведено = 0 Тогда

        Режим = РежимДиалогаВопрос.ДаНет;
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
        ПоказатьВопрос(Оповещение, "Кількість введена менше ніж потрібно, перейти до наступного місця?", Режим, 0);
        Возврат;
    КонецЕсли;

    ОбработатьПереходВперед();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад(Команда)
    СтрокаТовараТекущая = СтрокаТовараТекущая - 1;

    Если СтрокаТовараТекущая = 0 Тогда
        СтрокаТовараТекущая = 1;
        Если ИД_Статус = 1 Тогда
            ИД_Статус = 0;
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
                "ГруппаДокумент,ГруппаУпаковкаКоробка", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаКнопки",
                "Видимость", Истина);
            Возврат;
        КонецЕсли;
        ОтменитьОтборРезерва();

    Иначе
        новСтрокатовары = ТаблицаТовары[СтрокаТовараТекущая - 1];
        ОбработатьПереходКнопкиВпередНазад(новСтрокатовары);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутсяКОтбору(Команда)

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаТовара,ГруппаКнопки",
        "Видимость", Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкиОтменаОК,ГруппаРасхождения",
        "Видимость", Ложь);

    ИД_Статус = 1;
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьОтбор(Команда)
    ЗакончитьОтборАсинх();
КонецПроцедуры
&НаКлиенте
Асинх Процедура ЗакончитьОтборАсинх()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Закінчити відбір", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    РезультатВыгрузки = ВыгрузитьРезультатыСканирования();
    Если РезультатВыгрузки.Успешно Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть(РезультатВыгрузки);
    КонецЕсли;

КонецПроцедуры
&НаСервере
Функция ВыгрузитьРезультатыСканирования()

    СтруктураВозврат = Новый Структура("КоличествоРезервов,Успешно", 0, Ложь);

    МассивТовары = Новый Массив;
    ФиксСтруктура ="Артикул,Характеристика,Коэффициент,КоличествоВведено";
    Для Каждого стрТовар Из ТаблицаТовары Цикл
        Если стрТовар.КоличествоВведено = 0 Тогда
            Продолжить;
        КонецЕсли;
        СтруктураСтрока = Новый Структура(ФиксСтруктура);
        ЗаполнитьЗначенияСвойств(СтруктураСтрока, стрТовар);
        МассивТовары.Добавить(СтруктураСтрока);

    КонецЦикла;
    МассивТоварыПоТележкам = Новый Массив;
    ФиксСтруктура ="Артикул,Характеристика,Коэффициент,КоличествоВведено,Телега";

    Для Каждого стрТоварТелега Из ТаблицаТоварыУпаковщик Цикл
        Если стрТоварТелега.КоличествоВведено = 0 Тогда
            Продолжить;
        КонецЕсли;
        СтруктураСтрока = Новый Структура(ФиксСтруктура);
        ЗаполнитьЗначенияСвойств(СтруктураСтрока, стрТоварТелега);
        МассивТоварыПоТележкам.Добавить(СтруктураСтрока);

    КонецЦикла;            
	//МассивТоварыМРЦ = Новый Массив; 
	//ФиксСтруктура = "идПроизводитель,ДанныеШтрихКода,Артикул,Характеристика,КоличествоВведено";
	//Для Каждого стрТовар Из ТаблицаШтрихКодаПроизводителей Цикл 
	//	нстрокаСтруктура = Новый Структура(ФиксСтруктура);	
	//	ЗаполнитьЗначенияСвойств(нстрокаСтруктура,стрТовар);
	//	МассивТоварыМРЦ.Добавить(нстрокаСтруктура);
	//КонецЦикла;
    Если МассивТовары.Количество() = 0 Или МассивТоварыПоТележкам.Количество() = 0 Тогда
        Сообщить("Немає товарів для вивантаження");
        Возврат СтруктураВозврат;
    КонецЕсли;

    СтруктураДокумента = Новый Структура;
    СтруктураДокумента.Вставить("UUID_Документ", ДокументUUID);
    СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
    СтруктураДокумента.Вставить("UUID_Телега", ТекТелега);
    СтруктураДокумента.Вставить("НачалоКонтроля", НачалоКонтроля);
    СтруктураДокумента.Вставить("Товары", МассивТовары);
    СтруктураДокумента.Вставить("ТоварыТележка", МассивТоварыПоТележкам);

    ТекстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/DocVolnaFinih";
    РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента, ТекстЗапроса);

    Если РезОтвет.Результат Тогда
        СтруктураВозврат.КоличествоРезервов = РезОтвет.Ответ.ОчередьСборки;
        СтруктураВозврат.Успешно = Истина;
        ДокументUUID ="";

    Иначе
        Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
            Сообщить(РезОтвет.ОписаниеОшибки);
        Иначе
            Сообщить("Помилка вивантаження документа!");
        КонецЕсли;

    КонецЕсли;
    Возврат СтруктураВозврат;

КонецФункции
&НаКлиенте
Асинх Процедура ОтменитьОтборРезерва()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Скасувати відбір резерву?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    ИД_Статус = 0;
    РезОтмена =	ОтменитьСборкуРезерва();
    Если РезОтмена.Отменен Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть(РезОтмена);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОтменитьСборкуРезерва()

    стрВозврат = Новый Структура("КоличествоРезервов,Отменен", 0, Ложь);
    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/volnaotmena?uuiddoc=" + ДокументUUID + "&uuidcom="
        + ПараметрыСеанса.Сотрудник_ID;

    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        ДокументUUID ="";
        стрВозврат.КоличествоРезервов = РезОтвет.Ответ.ОчередьСборки;
        стрВозврат.Отменен = Истина;

    Иначе
        Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
            Сообщить(РезОтвет.ОписаниеОшибки);
        Иначе
            Сообщить("Помилка скасування резерву!");
        КонецЕсли;

    КонецЕсли;
    Возврат стрВозврат;
КонецФункции
&НаКлиенте
Процедура ЗакрытьКоробку(Команда)
    ВсегоВКоробке = ВсегоТекВведеноУпаковщик(Ложь, Истина);

    Если ВсегоВКоробке = 0 Тогда
        Сообщить("Візок порожній");
        Возврат;
    КонецЕсли;

    ИдетПроцессСканированияТелеги = Истина;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУпаковкаКоробка", "Видимость",
        Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки,ГруппаДокумент", "Видимость",
        Ложь);
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьКолВоУпаковщик()

    ТекКолВВод = ТекКоличествоВведено;
    ВсегоВведено = ТекКолВВод + ВсегоТекВведеноУпаковщик() - ВсегоТекВведеноУпаковщик(Истина);

    Если ВсегоВведено > ТекКоличество Тогда
        Сообщить("перевищення! - " + Формат(ВсегоВведено - ТекКоличество, "ЧЦ=15; ЧДЦ=3"));
        Возврат;
    КонецЕсли;
    Если ТекиспХарактеристика = 1 Тогда

        ВыбратьМРЦ_Асинх(ТекХарактеристика, ТекАртикул, ТекКоэффициент, Истина);
        Возврат;
    КонецЕсли;

    отборКоробка = Новый Структура("Артикул,КоробкаНомер", ТекАртикул, КоробкаНомер);

    мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(отборКоробка);
    Если мУпаковщик.Количество() Тогда
        смУпаковка = мУпаковщик[0];
    Иначе
        смУпаковка = ТаблицаТоварыУпаковщик.Добавить();
        смУпаковка.Артикул = ТекАртикул;
        смУпаковка.Характеристика = ТекХарактеристика;
        смУпаковка.КоробкаНомер = КоробкаНомер;
    КонецЕсли;

    смУпаковка.КоличествоВведено = ТекКолВВод;
    смУпаковка.Коэффициент = ТекКоэффициент;
    смУпаковка.Телега = ТекТелега;
    ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ДекорацияПерейти", "Видимость",
        ТекКоличествоВведеноКоробка = ТекКоличество);

КонецПроцедуры

&НаКлиенте
Процедура ТекКоличествоВведеноПриИзменении(Элемент)

    ДобавитьКолВоУпаковщик();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКолВо(Команда)

    колВоДобавить = ТекКоличество - ТекКоличествоВведеноКоробка;
    ТекКоличествоВведено = ТекКоличествоВведено + колВоДобавить;

    ДобавитьКолВоУпаковщик();

КонецПроцедуры
#Область Ввод_МРЦ
&НаКлиенте
Процедура ОбработатьШтрихКодФМ_БАТ(ПолученныйШтрихКод, Параметры)

    ЭтоШККороба 	= СтрДлина(ПолученныйШтрихкод) > 60 И Лев(ПолученныйШтрихкод, 3) = "010";
    ЭтоШКБлока 	= Не ЭтоШККороба И ((СтрДлина(ПолученныйШтрихкод) > 16 И (Лев(ПолученныйШтрихкод, 3) = "010" Или Лев(
        ПолученныйШтрихкод, 3) = "343")));	//тут

    Если ЭтоШККороба = Ложь И ЭтоШКБлока = Ложь Тогда
        Сообщить("Відскануйте штрих-код виробника");
        Возврат;
    КонецЕсли;
    Если Лев(ПолученныйШтрихкод, 3) = "010" Тогда
        текШтрихКод = Сред(ПолученныйШтрихкод, 4, 13);
    Иначе
        текШтрихКод = Сред(ПолученныйШтрихкод, 4, 8);
        Пока Лев(текШтрихКод, 1) = "0" Цикл
            текШтрихКод = Прав(текШтрихКод, СтрДлина(текШтрихКод) - 1);
        КонецЦикла;
    КонецЕсли;

    Если ТекПроизводитель = 1 Или ТекПроизводитель = 2 Тогда  // 1-PMU, 2-BAT 
        нмШтрихПроизв =  ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("ДанныеШтрихКода",
            ПолученныйШтрихКод));
        Если нмШтрихПроизв.Количество() > 0 Тогда
            Сообщить("штрих-код виробника відскановано раніше");
            Возврат;
        КонецЕсли;
		
		//ПроверитьШтрихНаСервере
        Если ПроверитьШтрихКодПоставщикаНаСервере(ПолученныйШтрихКод) Тогда
            Сообщить("штрих-код виробника відскановано раніше");
            Возврат;
        КонецЕсли;

    КонецЕсли;
    знПолученныйШтрихкод = текШтрихКод;

    нСтркиШтрихКод = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("ШтрихКод", знПолученныйШтрихкод));
    Если нСтркиШтрихКод.Количество() = 0 Тогда
        Сообщить("У документі немає товару з цим штрихкодом - " + ПолученныйШтрихкод);
        Возврат;
    КонецЕсли;

    СтрШтрихКод = нСтркиШтрихКод[0];
    Если Не СтрШтрихКод.Артикул = ТекАртикул Тогда
        Сообщить("Штрихкод не належить товару - " + ТекНаименованиеТовара);
        Возврат;
    КонецЕсли;
    ШтрихКодКоэффициент = СтрШтрихКод.Коэффициент;

    КодМРЦ = "";
    Если ТекПроизводитель = 1 Тогда //PMU
        Если ЭтоШКБлока Тогда
            КодМРЦ = Прав(ПолученныйШтрихКод, 11);
        КонецЕсли;
    ИначеЕсли ТекПроизводитель = 2 Тогда  //BAT
        Если ЭтоШКБлока Тогда
            КодМРЦ = Прав(ПолученныйШтрихКод, 8);
        ИначеЕсли ЭтоШККороба Тогда
            ПозицияМРЦ = СтрНайти(ПолученныйШтрихКод, "240", НаправлениеПоиска.СНачала, 14) + 3;
            Если ПозицияМРЦ > 3 Тогда
                КодМРЦ = Сред(ПолученныйШтрихКод, ПозицияМРЦ, 8);
            КонецЕсли;
        КонецЕсли;
    ИначеЕсли ТекПроизводитель = 3 Тогда  //JTI
        Если ЭтоШКБлока Тогда
            КодМРЦ = Прав(ПолученныйШтрихКод, 8);
        КонецЕсли;
    КонецЕсли;

    РазмерМРЦ = 0;
    Если Не ПустаяСтрока(КодМРЦ) Тогда
        РазмерМРЦ = ПолучитьМРЦ_ПоКоду(ТекАртикул, КодМРЦ);
    КонецЕсли;

    Если РазмерМРЦ = 0 Тогда // нужно выбрать мрц
        ВыбратьМРЦ_Асинх(РазмерМРЦ, ПолученныйШтрихКод, ШтрихКодКоэффициент);
    Иначе
        ОбработатьВводМРЦ(РазмерМРЦ, ПолученныйШтрихКод, ШтрихКодКоэффициент);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводМРЦ(РазмерМРЦ, ПолученныйШтрихКод, ШтрихКодКоэффициент, РучнойВвод = Ложь)

    Если РазмерМРЦ = 0 Тогда
        Сообщить("МРЦ не вибрано!");
        Возврат;
    КонецЕсли;

    Если РучнойВвод Тогда

        мСтрокиТоварМРЦ = ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("Артикул", ТекАртикул));
        Если мСтрокиТоварМРЦ.Количество() = 0 Тогда
            НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить();
        ИначеЕсли мСтрокиТоварМРЦ.Количество() = 1 Тогда
            НоваяСтрокаШКП = мСтрокиТоварМРЦ[0];
        Иначе
            Для Каждого стрТоварМРЦ Из мСтрокиТоварМРЦ Цикл
                ТаблицаШтрихКодаПроизводителей.Удалить(стрТоварМРЦ);
            КонецЦикла;
            НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить();
        КонецЕсли;

        ТекХарактеристика = РазмерМРЦ;
        НоваяСтрокаШКП.идПроизводитель = ТекПроизводитель;
        НоваяСтрокаШКП.ДанныеШтрихКода = ПолученныйШтрихКод;
        НоваяСтрокаШКП.Артикул = ТекАртикул;
        НоваяСтрокаШКП.Характеристика = РазмерМРЦ;
        НоваяСтрокаШКП.КоличествоВведено = ТекКоличествоВведено;
        ; 

		
		мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,КоробкаНомер", ТекАртикул,
            КоробкаНомер));
        Если мУпаковщик.Количество() Тогда
            смУпаковка = мУпаковщик[0];
        Иначе
            смУпаковка = ТаблицаТоварыУпаковщик.Добавить();
            смУпаковка.Артикул = ТекАртикул;
            смУпаковка.КоробкаНомер = КоробкаНомер;
        КонецЕсли;

        смУпаковка.КоличествоВведено = ТекКоличествоВведено;
        смУпаковка.Коэффициент = ТекКоэффициент;
        смУпаковка.Телега = ТекТелега;

        ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
    Иначе
        Если ТекКоэффициент = ШтрихКодКоэффициент Тогда
            ДобавитьНовТекКоличествоВведено =  1;
        Иначе
            ДобавитьНовТекКоличествоВведено = ШтрихКодКоэффициент / ?(ТекКоэффициент = 0, 1, ТекКоэффициент);
        КонецЕсли;

        Если ДобавитьНовТекКоличествоВведено < 1 Тогда
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати " + ДобавитьНовТекКоличествоВведено
                + " відскануйте штрихкод " + ТекУпаковка);
            Возврат;
        КонецЕсли;
        НовТекКоличествоВведено = ТекКоличествоВведено + ДобавитьНовТекКоличествоВведено;

        Если НовТекКоличествоВведено > ТекКоличество Тогда
            Сообщить("Перевищено кількість відбору!");
            Возврат;
        КонецЕсли;

        ТекКоличествоВведено = НовТекКоличествоВведено;

        ТекХарактеристика = РазмерМРЦ;
        НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить();
        НоваяСтрокаШКП.идПроизводитель = ТекПроизводитель;
        НоваяСтрокаШКП.ДанныеШтрихКода = ПолученныйШтрихКод;
        НоваяСтрокаШКП.Артикул = ТекАртикул;
        НоваяСтрокаШКП.Характеристика = РазмерМРЦ;
        НоваяСтрокаШКП.КоличествоВведено = ДобавитьНовТекКоличествоВведено;

        мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,КоробкаНомер", ТекАртикул,
            КоробкаНомер));
        Если мУпаковщик.Количество() Тогда
            смУпаковка = мУпаковщик[0];
        Иначе
            смУпаковка = ТаблицаТоварыУпаковщик.Добавить();
            смУпаковка.Артикул = ТекАртикул;
            смУпаковка.КоробкаНомер = КоробкаНомер;
        КонецЕсли;

        смУпаковка.КоличествоВведено = НовТекКоличествоВведено;
        смУпаковка.Коэффициент = ТекКоэффициент;
        смУпаковка.Телега = ТекТелега;

        ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
    КонецЕсли;
    Если ТекКоличествоВведено = ТекКоличество Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара",
            "Видимость", Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость", Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара",
            "Видимость", Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьМРЦ_Асинх(РазмерМРЦ, ПолученныйШтрихКод, ШтрихКодКоэффициент, РучнойВвод = Ложь)
    СписокОстаткиМРЦ = ПолучитьМРЦ_НаОстатке(ТекАртикул, СкладUUID);
    Если СписокОстаткиМРЦ.Количество() = 0 Тогда
        Сообщить("Немає залишку");
        Возврат;
    КонецЕсли;

    Обещание = СписокОстаткиМРЦ.ВыбратьЭлементАсинх("МРЦ");
    Рез = Ждать Обещание;
    Если Рез = Неопределено Тогда
        РазмерМРЦ = 0;
    Иначе
        РазмерМРЦ = Рез.Значение;
    КонецЕсли;
    ОбработатьВводМРЦ(РазмерМРЦ, ПолученныйШтрихКод, ШтрихКодКоэффициент, РучнойВвод);

КонецПроцедуры

#КонецОбласти
&НаСервереБезКонтекста
Процедура ОбработатьВесовойШтрихкод(структураШтриход)
    РегистрыСведений.Штрихкоды.ПреобразоватьВесовойШтрихкод(структураШтриход);
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПроверитьШтрихКодПоставщикаНаСервере(ШК)

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/chkp?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&chk=" + ШК;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        ШтрихКодОтсканирован = ?(РезОтвет.Ответ.ШКРез = 1, Истина, Ложь);
    Иначе
        ШтрихКодОтсканирован = Истина;
    КонецЕсли;

    Возврат ШтрихКодОтсканирован
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМРЦ_ПоКоду(Знач АртикулТовара, Знач КодМРЦ)

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/mrc?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&art="
        + АртикулТовара + "&kodmrc=" + КодМРЦ;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        РазмерМРЦ = РезОтвет.Ответ.РазмерМРЦ;
    Иначе
        РазмерМРЦ = 0;
    КонецЕсли;

    Возврат РазмерМРЦ
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьИсключение(АртикулТовара)
    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/isk?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&art="
        + АртикулТовара;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        РезОтвет = РезОтвет.Ответ.ИсключениеПоставщика;
    Иначе
        РезОтвет = 0;
    КонецЕсли;

    Возврат Булево(РезОтвет);

КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьНапечатьЧекрезерв(РезервUUID)

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/chekrez?uuidcom=" + ПараметрыСеанса.Сотрудник_ID
        + "&UUIDrez=" + РезервUUID;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        РезОтвет = 1;
    Иначе
        РезОтвет = 0;
    КонецЕсли;

    Возврат Булево(РезОтвет);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМРЦ_НаОстатке(Знач АртикулТовара, Знач СкладUUID)

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/mrcost?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&art="
        + АртикулТовара + "&skladuuid=" + СкладUUID;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    СписокОстаткиМРЦ = Новый СписокЗначений;
    Если РезОтвет.Результат Тогда

        Для Каждого стрОстМРЦ Из РезОтвет.Ответ.ОстаткиМРЦ Цикл
            СписокОстаткиМРЦ.Добавить(стрОстМРЦ.МРЦ, Формат(стрОстМРЦ.МРЦ, "ЧЦ=10; ЧДЦ=2; ЧРД=.; ЧН=Ноль") + " ост. "
                + Формат(стрОстМРЦ.Остаток, "ЧЦ=5; ЧДЦ=0; ЧН=Ноль"));
        КонецЦикла;

    КонецЕсли;

    Возврат СписокОстаткиМРЦ

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПринтерПечати(ШК) Экспорт

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/prnp?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&chk=" + ШК;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Если РезОтвет.Результат Тогда
        ПринтерРабочий = Истина;
    Иначе
        ПринтерРабочий = Ложь;
    КонецЕсли;

    Возврат Новый Структура("ПринтерРабочий,ТекстОшибки", ПринтерРабочий, РезОтвет.ОписаниеОшибки);

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьТележку(ШК) Экспорт

    текстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/tlnp?uuidcom=" + ПараметрыСеанса.Сотрудник_ID + "&chk=" + ШК;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    ТележкаОК = Ложь;
    Если РезОтвет.Результат Тогда
        ТележкаОК = Истина;
    КонецЕсли;

    Возврат Новый Структура("ТележкаРабочий,ТекстОшибки", ТележкаОК, РезОтвет.ОписаниеОшибки);

КонецФункции
&НаКлиенте
Процедура ТекНаименованиеТовараНажатие(Элемент, СтандартнаяОбработка)
    а= 1;
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаРасхожденийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;

    ТекущиеДанные = Элементы.ТаблицаРасхождений.ТекущиеДанные;

    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтруктураСтроки = Новый Структура("ИдентификаторСтрокиТоваров,Артикул,НаименованиеТовара,Упаковка,Количество,КоличествоВведено,Весовой,КоличествоБаз");
    ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
КонецПроцедуры
